import MyComponentProps from './MyComponentProps'
import {useState} from 'react'
import { useMyContext } from "../../State/MyContext"
import imgs from './TopUniversImgs'

const TopUnivers: React.FC<MyComponentProps> = ({ Cityname }) => {
  const { state } = useMyContext()
  const [readMore, setReadMore] = useState(false)

  const MoscowUniversities = [
    {
      name: "جامعة موسكو الحكومية",
      img: imgs.Moscow[0],
      infos: ['جامعة موسكو الحكومية هي مؤسسة تعليمية تقليدية رئيسية في روسيا تقدم التدريب في جميع فروع العلوم والعلوم الإنسانية الحديثة تقريبا. يمكن للطلاب الجامعيين اختيار واحد من 128 مؤهلات في 39 كليات ، في حين أن طلاب الدراسات العليا قد تتخصص في 18 فرعا للعلوم والعلوم الإنسانية وفي 168 مجالات مختلفة', 'أسست الجامعة في عام 1755 من قبل اللغوي إم في لومونوسوف وتم تصميمها على غرار الجامعات الألمانية ، حيث كانت هيئة التدريس الأصلية في الغالب ألمانية 2. في النصف الثاني من القرن ال19, أصبحت جامعة موسكو الحكومية أهم مركز للبحث العلمي والمنح الدراسية في روسيا 2', 'تحتل جامعة موسكو الحكومية المرتبة 1 في روسيا والمرتبة 169 في التصنيف العالمي لعام 2023'],
      link: "https://www.msu.ru/en/",
    },
    {
      name: "الجامعة الوطنيه للبحوث المدرسه العليا للاقتصاد",
      img: imgs.Moscow[1],
      infos: ['المدرسة العليا للاقتصاد بجامعة الأبحاث الوطنية هي جامعة بحثية وطنية تقع في موسكو ولها فروع في سانت بطرسبرغ وبيرم ونيجني نوفغورود', 'تقدم الجامعة مجموعة واسعة من البرامج التعليمية من برامج البكالوريوس والماجستير', 'الجامعة الوطنية للبحوث المدرسة العليا للاقتصاد في المرتبة #561 في أفضل الجامعات العالمية والمرتبة 3 في روسيا'],
      link: "https://www.hse.ru/en/",
    },
    {
      name: "معهد موسكو للفيزياء والتكنولوجيا",
      img: imgs.Moscow[2],
      infos: [],
      link: "https://mipt.ru/",
    },
    {
      name: "الجامعة الوطنية للبحوث النووية",
      img: imgs.Moscow[3],
      infos: [],
      link: "https://eng.mephi.ru/",
    },
    {
      name: "الجامعة الروسية لصداقة الشعوب",
      img: '',
      infos: [],
      link: "https://eng.rudn.ru/",
    },

  ]
  const StPetersburgUniversities = [
    {
      name: "جامعة سانت بطرسبرغ الحكومية",
      infos: ["تعد جامعة جامعة سانت بطرسبرغ الحكومية واحدة من أعرق وأقدم الجامعات في روسيا ، حيث يعود تاريخها إلى عام 1724. تشتهر الجامعة بتميزها الأكاديمي وأبحاثها المبتكرة والتزامها بتزويد الطلاب بتعليم على مستوى عالمي.    تتمثل إحدى نقاط القوة الرئيسية في الجامعة في هيئة التدريس المؤهلة تأهيلا عاليا ، والتي تضم الحائزين على جائزة نوبل وأعضاء الأكاديمية الروسية للعلوم وغيرهم من العلماء المتميزين. وهذا يضمن حصول الطلاب على تعليم عالي الجودة من بعض أفضل العقول في مجالات تخصصهم.  تقدم الجامعة مجموعة واسعة من البرامج الأكاديمية ، بما في ذلك برامج البكالوريوس والدراسات العليا ، بالإضافة إلى برامج الدكتوراه في مختلف مجالات الدراسة ، بما في ذلك العلوم الطبيعية والعلوم الاجتماعية والعلوم الإنسانية والفنون. يوجد بالجامعة أيضًا العديد من المعاهد البحثية المتخصصة ، بما في ذلك معهد التاريخ ومعهد الفلسفة ومعهد الدراسات الشرقية.  بالإضافة إلى نقاط قوتها الأكاديمية ، تقدم جامعة سانت بطرسبرغ الحكومية للطلاب حياة طلابية نابضة بالحياة ومتنوعة ، مع العديد من المنظمات الطلابية والفرق الرياضية والأنشطة الثقافية والفعاليات. يوفر موقع الجامعة في قلب مدينة سانت بطرسبرغ ، إحدى أجمل المدن التاريخية في روسيا ، للطلاب تجربة ثقافية واجتماعية لا مثيل لها.  بشكل عام ، تعد جامعة سانت بطرسبرغ الحكومية اختيارًا ممتازًا للطلاب الذين يسعون للحصول على تعليم من الدرجة الأولى ومجتمع ديناميكي وداعم وتجربة ثقافية لا تُنسى."],
      link: "https://english.spbu.ru/",
      img: imgs.StPetersburg[0],
      
    },
    {
      name: " ITMO جامعة ",
      infos: ["تقع جامعة ITMO في مدينة سانت بطرسبرغ الجميلة ، وهي جامعة رائدة في روسيا والعالم في مجالات تكنولوجيا المعلومات والضوئيات والروبوتات. إن التزام الجامعة بالابتكار والبحوث المتطورة وفرص التعلم العملي يجعلها الخيار الأفضل للطلاب المهتمين بمتابعة المهن في مجال التكنولوجيا والهندسة.  تتمثل إحدى نقاط القوة الرئيسية في ITMO في هيئة التدريس ذات المستوى العالمي ، وكثير منهم خبراء بارزون في مجالات تخصصهم. يكرس أساتذة وباحثو الجامعة جهودهم لتطوير تقنيات وتقنيات جديدة تدفع حدود ما هو ممكن في مجالات مثل الذكاء الاصطناعي والبيانات الضخمة ورؤية الكمبيوتر والروبوتات.  تقدم ITMO مجموعة واسعة من البرامج الأكاديمية ، بما في ذلك شهادات البكالوريوس والدراسات العليا ، بالإضافة إلى البرامج المتخصصة في مجالات مثل هندسة البرمجيات والأمن السيبراني والضوئيات. يعني تركيز الجامعة على التعلم العملي والعملي أنه يتم منح الطلاب العديد من الفرص للعمل في مشاريع واقعية واكتساب خبرة عملية في المجالات التي يختارونها.  بالإضافة إلى برامجها الأكاديمية ، تعد ITMO موطنًا للعديد من مراكز الأبحاث المتطورة ، بما في ذلك مركز الأبحاث الدولي للبوتونات النانوية والمواد الفوقية ومركز تقنيات الكم وعلوم المواد. تجمع مراكز الأبحاث هذه خبراء من جميع أنحاء العالم للتعاون في مشاريع جديدة مبتكرة وتطوير تقنيات جديدة لديها القدرة على تغيير العالم.أخيرًا ، تشتهر جامعة ITMO بمجتمعها النابض بالحياة والشامل ، والذي يضم طلابًا من جميع أنحاء روسيا والعالم. تقدم الجامعة العديد من الفرص للطلاب للمشاركة في الأنشطة اللامنهجية ، بما في ذلك النوادي والفرق الرياضية والفعاليات الثقافية.  باختصار ، تعد جامعة ITMO اختيارًا ممتازًا للطلاب المتحمسين للتكنولوجيا والابتكار ويريدون أن يكونوا في طليعة البحث والتطوير المتطور. مع أعضاء هيئة التدريس على مستوى عالمي ، والبرامج الأكاديمية المبتكرة ، والمجتمع النابض بالحياة ، تعد ITMO الخيار الأفضل للطلاب المهتمين بمتابعة وظائف في التكنولوجيا والهندسة."],
      link: "https://en.itmo.ru/",
      img: imgs.StPetersburg[1],
    },
    {
      name: "جامعة سانت بطرسبرغ الحكوميه للفنون التطبيقيه ",
      infos: ["جامعة بطرسبرغ الحكومية للفنون التطبيقية (SPbPU) هي واحدة من أقدم وأعرق الجامعات التقنية في روسيا ، ولها تاريخ غني من الإنجازات العلمية والتكنولوجية. تقدم الجامعة مجموعة واسعة من برامج البكالوريوس والدراسات العليا في الهندسة والتكنولوجيا والعلوم والاقتصاد والعلوم الإنسانية. لديها أكثر من 30000 طالب ، بما في ذلك الطلاب الدوليين من أكثر من 100 دولة.تشتهر الجامعة بمرافقها البحثية ذات المستوى العالمي والتكنولوجيا المتطورة. يوجد في SPbPU العديد من المعاهد والمراكز البحثية ، بما في ذلك معهد الرياضيات التطبيقية والميكانيكا ، ومعهد الفيزياء النووية ، ومعهد علوم وتكنولوجيا الكمبيوتر. كما أنها موطن للمركز الوطني للحواسيب الفائقة ومركز الابتكار ونقل التكنولوجيا.  تتمتع SPbPU بشراكات قوية مع جامعات ومؤسسات بحثية رائدة في جميع أنحاء العالم ، وتشارك بنشاط في التعاون الأكاديمي والبحثي الدولي. الجامعة عضو في العديد من الجمعيات الدولية ، بما في ذلك رابطة الجامعات الأوروبية والرابطة الدولية للجامعات.يقع حرم SPbPU في قلب مدينة سانت بطرسبرغ ، وهي مدينة تشتهر بتاريخها الغني وثقافتها وهندستها المعمارية. تمتلك الجامعة مرافق حديثة ، بما في ذلك المختبرات والمكتبات والمراكز الرياضية ومهاجع الطلاب المجهزة تجهيزًا جيدًا.بشكل عام ، جامعة بطرسبرغ الحكومية للفنون التطبيقية هي مؤسسة عالمية توفر فرصًا تعليمية وبحثية ممتازة في الهندسة والتكنولوجيا. إنه الخيار الأفضل للطلاب المهتمين بممارسة مهنة في العلوم والتكنولوجيا والابتكار."],
      link: "https://english.spbstu.ru/",
      img: imgs.StPetersburg[3],
    },
    {
      name: "جامعة سانت بطرسبرغ الحكومية الكهروتقنية",
      infos: ["جامعة سانت بطرسبرغ الكهروتقنية ، والمعروفة أيضًا باسم  ، هي جامعة روسية رائدة للتعليم العالي تقع في سانت بطرسبرغ ، روسيا. تأسست الجامعة عام 1886 وهي من أقدم الجامعات التقنية في روسيا. تقدم LETI مجموعة واسعة من برامج البكالوريوس والدراسات العليا في الهندسة الكهربائية وعلوم الكمبيوتر والأتمتة والتحكم والمجالات الأخرى ذات الصلة. تركز الجامعة بشدة على البحث والابتكار ، مع أكثر من 50 معهدًا ومختبرًا للبحوث.تضم الجامعة مجموعة متنوعة من الطلاب تضم أكثر من 10000 طالب من جميع أنحاء العالم. يوفر LETI مرافق ممتازة للطلاب ، بما في ذلك قاعات المحاضرات الحديثة ومختبرات البحوث ومكتبة كبيرة. تلتزم الجامعة بقوة بتعزيز التنوع الثقافي والتعاون الدولي ، مع العديد من برامج التبادل والشراكات مع جامعات أخرى حول العالم.    تتمتع LETI بسمعة طيبة في إنتاج خريجين ذوي مهارات عالية ومستعدين جيدًا لشغل وظائف في صناعة التكنولوجيا. تتمتع الجامعة بعلاقات وثيقة مع كبرى شركات التكنولوجيا الروسية والدولية ، مما يوفر فرصًا ممتازة للطلاب لاكتساب الخبرة العملية وفرص العمل.    في الختام ، تعد جامعة سانت بطرسبرغ الكهروتقنية مؤسسة مرموقة تقدم برامج أكاديمية وفرص بحث ممتازة للطلاب المهتمين في مجالات الهندسة الكهربائية وعلوم الكمبيوتر والأتمتة والتحكم والمجالات ذات الصلة. من خلال التزامها القوي بالبحث والابتكار والتعاون الدولي ، تعد LETI الخيار الأفضل للطلاب الذين يسعون للحصول على تعليم على مستوى عالمي في هذه المجالات."],
      link: "https://etu.ru/",
    },
    {
      name: " جامعة سانت بطرسبرغ للتعدين",
      infos: [],
      link: "https://en.spmi.ru/",
    },
  ]
  const UfaUniversities = [
    {
      name: "",
      img: "",
      infos: [],
      link: "",
    },
  ]
  const KazanUniversities = [
    {
      name: "",
      img: "",
      infos: [],
      link: "",
    },
  ]
  const RostovUniversities = [
    {
      name: "",
      img: "",
      infos: [],
      link: "",
    },
  ]
  const YekaterinburgUniversities = [
    {
      name: "",
      img: "",
      infos: [],
      link: "",
    },
  ]

  let Cityimgs: Array<string> = []
  let CityUniversities: Array<any> = []
  switch (Cityname) {
    case "Moscow":
      CityUniversities = MoscowUniversities
      Cityimgs = imgs.Moscow
      break
    case "St Petersburg":
      CityUniversities = StPetersburgUniversities
      Cityimgs = imgs.StPetersburg
      break
    case "Ufa":
      CityUniversities = UfaUniversities
      Cityimgs = imgs.Ufa
      break
    case "Kazan":
      CityUniversities = KazanUniversities
      Cityimgs = imgs.Kazan
      break
    case "Rostov":
      CityUniversities = RostovUniversities
      Cityimgs = imgs.Rostov
      break
    case "Yekaterinburg":
      CityUniversities = YekaterinburgUniversities
      Cityimgs = imgs.Yekaterinburg
      break
  }
  const CityUniversitiesHtml: Array<JSX.Element> = CityUniversities.map(({ name, infos, link }, i) => {
    return (
      <div key={i} className={'w-full max-w-6xl  rounded-br-3xl shadow-lg py-8 text-right flex-col-reverse justify-end flex mt-10 md:mt-28  ' + state.bgApp + state.shadowColor + (i === 0 || i % 2 === 0 ? "md:flex-row-reverse" : "md:flex-row")}>
        <div className='md:w-2/3 text-right ltr bidi-override'>
          {infos.map((info: string, i: number) => {
            return <p key={i} className={'font-Cairo text-xs md:text-base text-right mx-8 my-2 ' + state.fontColor}>{readMore? info: `${info.substring(0,1000)}...`}
            <button className="text-sky-400 hover:text-sky-800 font-bold py-2 px-4 rounded:" onClick={()=> setReadMore(!readMore)}>{readMore? "عرض أقل" : "اقرأ أكثر"}</button></p>
          })}
          <a className='font-Cairo text-sm md:text-base text-center mx-8 text-[#48cae4] font-bold underline ' target="_blank" href={link}>موقح الجامعة</a>
        </div>
        <div >
          <div className='select-none'><img src={Cityimgs[i]} className={"hidden md:block -mt-24 h-96 w-96 rounded-lg shadow-lg  " + state.shadowColor}></img></div>
          <h1 className={'font-Cairo text-sm md:text-xl font-extrabold text-center mt-1 ' + state.fontColor} >{name}</h1>
        </div>
      </div>
    )
  })

  return (
    <div>
      <div className={'w-full mt-8 flex justify-center '}>
        <div className={"w-full max-w-6xl p-8 rounded-2xl shadow-lg flex flex-col justify-center items-center mx-2  " + state.bgColor + state.shadowColor}>

          <div className='flex justify-center mb-2'>
            <div className={'h-px w-6 mt-3 md:mt-4 mr-1 ' + (state.dark ? "bg-[#FFFFFF] " : "bg-[#214966] ")} ></div>
            <h1 className={'font-Cairo md:text-xl text-sm font-extrabold text-center ' + state.fontColor}>اشهر الجامعات في المدينة</h1>
            <div className={'h-px w-6 mt-3 md:mt-4 mr-1 ' + (state.dark ? "bg-[#FFFFFF] " : "bg-[#214966] ")} ></div>
          </div>

          {CityUniversitiesHtml}

        </div>
      </div>
    </div>
  )
}

export default TopUnivers