import MyComponentProps from './MyComponentProps'
import {useState} from 'react'
import { useMyContext } from "../../State/MyContext"
import imgs from './TopUniversImgs'

const TopUnivers: React.FC<MyComponentProps> = ({ Cityname }) => {
  const { state } = useMyContext()
  const [readMore, setReadMore] = useState(false)

  const MoscowUniversities = [
    {
      name: "جامعة موسكو الحكومية",
      img: imgs.Moscow[0],
      infos: ['Lomonosov Moscow State University هي جامعة ذات مستوى عالمي تقع في موسكو ، روسيا. تأسست عام 1755 ، وهي واحدة من أقدم الجامعات وأكثرها شهرة في روسيا ، وتشتهر بتميزها الأكاديمي وقدراتها البحثية. تقدم الجامعة مجموعة واسعة من برامج الدرجات العلمية في مجالات مثل العلوم الطبيعية ، والعلوم الإنسانية ، والعلوم الاجتماعية ، والطب ، مما يوفر للطلاب مجموعة واسعة من الخيارات للاختيار من بينها. تتألف هيئة التدريس بالجامعة من أساتذة وعلماء وباحثين مشهورين ، وكثير منهم من كبار المسؤولين في مجالات تخصصهم. تعد جامعة Lomonosov Moscow State أيضًا موطنًا للعديد من مراكز البحث والمعاهد والمختبرات ، مما يوفر للطلاب فرصًا كبيرة للمشاركة في أحدث الأبحاث والابتكار. بالإضافة إلى ذلك ، تفتخر الجامعة بأحدث المرافق ، بما في ذلك المكتبات الحديثة ومختبرات الكمبيوتر والمرافق الرياضية ، مما يجعلها وجهة مثالية للطلاب الذين يبحثون عن تجربة تعليمية غنية ومرضية. بشكل عام ، تعد جامعة Lomonosov Moscow State مؤسسة استثنائية تقدم تعليمًا على مستوى عالمي وفرص بحث وحياة طلابية نابضة بالحياة ، مما يجعلها اختيارًا ممتازًا للطلاب الذين يرغبون في متابعة التعليم العالي في روسيا.'],
      link: "https://www.msu.ru/en/",
    },
    {
      name: "الجامعة الوطنيه للبحوث المدرسه العليا للاقتصاد",
      img: imgs.Moscow[1],
      infos: ['جامعة HSE ، أو المدرسة العليا للاقتصاد التابعة لجامعة الأبحاث الوطنية ، هي مؤسسة رائدة للتعليم العالي تقع في موسكو. تأسست الجامعة في عام 1992 ، وسرعان ما أصبحت واحدة من أفضل الجامعات في روسيا وتحظى بتقدير كبير عالميًا لتميزها الأكاديمي وقدراتها البحثية. تقدم الجامعة مجموعة متنوعة من برامج البكالوريوس والدراسات العليا والدكتوراه في مختلف المجالات ، بما في ذلك الاقتصاد والعلوم الاجتماعية والعلوم الإنسانية والقانون وعلوم الكمبيوتر والهندسة. تفتخر HSE University بأعضاء هيئة التدريس على مستوى عالمي ، والتي تضم كبار الخبراء والباحثين والممارسين في مجالات تخصصهم. تم تصميم منهج الجامعة لتزويد الطلاب بأساس نظري متين مع منحهم أيضًا فرصًا كبيرة لتطبيق معارفهم ومهاراتهم من خلال المشاريع البحثية والتدريب الداخلي والخبرة العملية. تعد جامعة HSE أيضًا موطنًا للعديد من مراكز ومعاهد البحث ، حيث يمكن للطلاب المشاركة في أحدث الأبحاث والابتكار في مجالات تخصصهم. يوجد في الجامعة مجتمع طلابي نابض بالحياة ، مع العديد من المنظمات الطلابية والأندية والفرق الرياضية ، مما يوفر للطلاب تجربة حياة غنية ومرضية في الحرم الجامعي. بشكل عام ، تعد HSE University اختيارًا ممتازًا للطلاب الذين يرغبون في متابعة التعليم العالي في روسيا واكتساب المعرفة والمهارات والخبرة القيمة للنجاح في وظائفهم المستقبلية.'],
      link: "https://www.hse.ru/en/",
    },
    {
      name: "معهد موسكو للفيزياء والتكنولوجيا",
      img: imgs.Moscow[2],
      infos: ['معهد موسكو للفيزياء والتكنولوجيا (MIPT) هو مؤسسة رائدة للتعليم العالي تقع في Dolgoprudny ، روسيا. تأسست MIPT في عام 1946 ، وتشتهر بتميزها الأكاديمي في مجالات الفيزياء والرياضيات وعلوم الكمبيوتر. تقدم الجامعة برامج البكالوريوس والدراسات العليا والدكتوراه عبر مجموعة من المجالات ، مما يوفر للطلاب مجموعة متنوعة من الخيارات للاختيار من بينها. لدى MIPT هيئة تدريس مؤهلة تأهيلا عاليا تضم أساتذة وعلماء وباحثين مشهورين هم قادة في مجالات تخصصهم. تم تصميم منهج الجامعة لتزويد الطلاب بأساس نظري صارم مع التأكيد أيضًا على الخبرة العملية وفرص البحث العملي. تمتلك MIPT أحدث المرافق ، بما في ذلك المعامل والمراكز البحثية المجهزة تجهيزًا جيدًا ، حيث يمكن للطلاب المشاركة في أحدث الأبحاث والابتكارات. تتمتع الجامعة بسمعة طيبة في تخريج خريجين استثنائيين قدموا مساهمات كبيرة في مجالات العلوم والتكنولوجيا. لدى MIPT أيضًا العديد من الشراكات مع المؤسسات العالمية الرائدة ، مما يوفر للطلاب فرصًا كبيرة للتعاون والتبادلات الدولية. بشكل عام ، يعد MIPT اختيارًا ممتازًا للطلاب المهتمين بمتابعة التعليم العالي في مجالات الفيزياء أو الرياضيات أو علوم الكمبيوتر ويرغبون في اكتساب أساس نظري قوي ومهارات عملية للنجاح في حياتهم المهنية في المستقبل. بالإضافة إلى تفوقها الأكاديمي ، تشتهر MIPT أيضًا ببرامجها البحثية القوية ونهجها المبتكر في التعليم. تعد الجامعة موطنًا للعديد من مراكز الأبحاث المتطورة ، بما في ذلك مركز MIPT للضوئيات والمواد ثنائية الأبعاد ، ومختبر MIPT للضوئيات الكمومية ، ومختبر MIPT للمواد فائقة التوصيل. تشارك مراكز البحث هذه في أبحاث رائدة في مجالات مثل فيزياء الكم وتكنولوجيا النانو وعلوم المواد. تركز MIPT أيضًا بشكل كبير على ريادة الأعمال والابتكار ، مع العديد من المبادرات التي تهدف إلى تعزيز ثقافة ريادة الأعمال ودعم الشركات الناشئة. تمتلك الجامعة مسرعًا مخصصًا لبدء التشغيل ، وهو مركز MIPT للابتكار ، والذي يوفر الموارد والدعم للطلاب وأعضاء هيئة التدريس الذين يتطلعون إلى بدء أعمالهم التجارية الخاصة. تستضيف MIPT أيضًا العديد من مسابقات الهاكاثون والابتكار على مدار العام ، مما يوفر للطلاب فرصًا لتطوير مهاراتهم في تنظيم المشاريع والتواصل مع المتخصصين في هذا المجال. بشكل عام ، يعد MIPT خيارًا ممتازًا للطلاب المهتمين بمتابعة تجربة أكاديمية صعبة ومجزية ، مع اكتساب مهارات بحثية وريادة أعمال قيّمة تميزهم في حياتهم المهنية في المستقبل.'],
      link: "https://mipt.ru/",
    },
    {
      name: "الجامعة الوطنية للبحوث النووية",
      img: imgs.Moscow[3],
      infos: ['معهد موسكو للفيزياء الهندسية (MEPI) هو مؤسسة مشهورة للتعليم العالي تقع في موسكو ، روسيا. تأسست MEPI في عام 1946 ، وهي معروفة بتميزها الأكاديمي في مجالات الهندسة والفيزياء والرياضيات التطبيقية. تقدم الجامعة برامج البكالوريوس والدراسات العليا والدكتوراه عبر مجموعة واسعة من المجالات ، مما يوفر للطلاب مجموعة متنوعة من الخيارات للاختيار من بينها. تضم MEPI هيئة تدريس مؤهلة تأهيلا عاليا تضم أساتذة وعلماء وباحثين مشهورين هم قادة في مجالات تخصصهم. تم تصميم منهج الجامعة لتزويد الطلاب بأساس نظري قوي مع التأكيد أيضًا على الخبرة العملية وفرص البحث العملي. تمتلك MEPI العديد من المرافق الحديثة ، بما في ذلك المعامل والمراكز البحثية المجهزة تجهيزًا جيدًا ، حيث يمكن للطلاب المشاركة في أحدث الأبحاث والابتكارات. تركز الجامعة بشدة على الأبحاث متعددة التخصصات ، مع العديد من مراكز ومعاهد البحث المخصصة لمجالات مثل الفيزياء النووية وتكنولوجيا النانو والطاقة المتجددة. تمتلك MEPI أيضًا برنامجًا قويًا لشراكة الصناعة ، بالتعاون مع الشركات العالمية الرائدة مثل Rosatom و Gazprom و Rostec ، مما يوفر للطلاب فرص تدريب وفرص وظيفية قيّمة. بشكل عام ، تعد MEPI خيارًا ممتازًا للطلاب المهتمين بمتابعة التعليم العالي في مجالات الهندسة أو الفيزياء أو الرياضيات التطبيقية ويرغبون في اكتساب أساس نظري قوي ومهارات عملية للنجاح في حياتهم المهنية في المستقبل. تركز MEPI بقوة على الابتكار وريادة الأعمال ، مع العديد من المبادرات التي تهدف إلى تعزيز ثقافة الابتكار ودعم الشركات الناشئة. يوجد بالجامعة مركز ابتكار مخصص ، وهو مركز MEPI للابتكار ، والذي يوفر الموارد والدعم للطلاب وأعضاء هيئة التدريس الذين يتطلعون إلى بدء أعمالهم التجارية الخاصة. تستضيف MEPI أيضًا العديد من الهاكاثونات ومسابقات الابتكار والمؤتمرات الصناعية على مدار العام ، مما يوفر للطلاب فرصًا لتطوير مهاراتهم في ريادة الأعمال ، والتواصل مع المتخصصين في هذا المجال ، وعرض أفكارهم المبتكرة. بالإضافة إلى ذلك ، فإن MEPI لديها التزام قوي بالتدويل ، مع مجتمع نابض بالحياة من الطلاب الدوليين وأعضاء هيئة التدريس. تمتلك الجامعة العديد من الشراكات مع المؤسسات العالمية الرائدة ، مما يوفر للطلاب فرصًا كبيرة للتعاون الدولي والمشاريع البحثية والتبادلات. تقدم MEPI أيضًا العديد من البرامج التي تُدرس بالكامل باللغة الإنجليزية ، مما يجعلها خيارًا ممتازًا للطلاب الدوليين الذين يتطلعون إلى متابعة التعليم العالي في روسيا. بشكل عام ، تعد MEPI خيارًا رائعًا للطلاب الذين يبحثون عن تجربة أكاديمية صعبة ومجزية ، مع اكتسابهم أيضًا مهارات البحث والابتكار وريادة الأعمال القيّمة التي تميزهم في وظائفهم المستقبلية.'],
      link: "https://eng.mephi.ru/",
    },
    {
      name: "الجامعة الروسية لصداقة الشعوب",
      img: '',
      infos: ["جامعة الصداقة بين الشعوب في روسيا ، والمعروفة أيضًا باسم جامعة RUDN ، هي جامعة من الدرجة الأولى تقع في موسكو. تأسست في عام 1960 ، تشتهر PFUR بنظرتها الدولية والتزامها بتعزيز التعاون والتفاهم العالميين. تقدم الجامعة مجموعة متنوعة من برامج البكالوريوس والدراسات العليا والدكتوراه في مختلف المجالات ، بما في ذلك العلوم الطبيعية والعلوم الإنسانية والعلوم الاجتماعية والطب. تمتلك PFUR هيئة طلابية متنوعة للغاية ، مع طلاب من أكثر من 150 دولة ، مما يجعلها جامعة متعددة الثقافات وعالمية حقًا. يوجد بالجامعة هيئة تدريس مؤهلة تأهيلا عاليا تضم أساتذة وعلماء وباحثين خبراء في مجالات تخصصهم. تمتلك PFUR أحدث المرافق ، بما في ذلك المكتبات الحديثة ومختبرات الكمبيوتر والمرافق الرياضية ، مما يوفر للطلاب تجربة حياة نابضة بالحياة في الحرم الجامعي. بالإضافة إلى ذلك ، تلتزم PFUR بتعزيز المسؤولية الاجتماعية والمشاركة المجتمعية ، مع العديد من البرامج والمبادرات التي تهدف إلى مواجهة التحديات المجتمعية وتعزيز التنمية المستدامة. بشكل عام ، يعد PFUR اختيارًا ممتازًا للطلاب الذين يرغبون في متابعة التعليم العالي في روسيا واكتساب المعرفة والمهارات والخبرة القيمة في بيئة متعددة الثقافات ومسؤولة اجتماعيًا."],
      link: "https://eng.rudn.ru/",
    },

  ]
  const StPetersburgUniversities = [
    {
      name: "جامعة سانت بطرسبرغ الحكومية",
      infos: ["تعد جامعة جامعة سانت بطرسبرغ الحكومية واحدة من أعرق وأقدم الجامعات في روسيا ، حيث يعود تاريخها إلى عام 1724. تشتهر الجامعة بتميزها الأكاديمي وأبحاثها المبتكرة والتزامها بتزويد الطلاب بتعليم على مستوى عالمي.    تتمثل إحدى نقاط القوة الرئيسية في الجامعة في هيئة التدريس المؤهلة تأهيلا عاليا ، والتي تضم الحائزين على جائزة نوبل وأعضاء الأكاديمية الروسية للعلوم وغيرهم من العلماء المتميزين. وهذا يضمن حصول الطلاب على تعليم عالي الجودة من بعض أفضل العقول في مجالات تخصصهم.  تقدم الجامعة مجموعة واسعة من البرامج الأكاديمية ، بما في ذلك برامج البكالوريوس والدراسات العليا ، بالإضافة إلى برامج الدكتوراه في مختلف مجالات الدراسة ، بما في ذلك العلوم الطبيعية والعلوم الاجتماعية والعلوم الإنسانية والفنون. يوجد بالجامعة أيضًا العديد من المعاهد البحثية المتخصصة ، بما في ذلك معهد التاريخ ومعهد الفلسفة ومعهد الدراسات الشرقية.  بالإضافة إلى نقاط قوتها الأكاديمية ، تقدم جامعة سانت بطرسبرغ الحكومية للطلاب حياة طلابية نابضة بالحياة ومتنوعة ، مع العديد من المنظمات الطلابية والفرق الرياضية والأنشطة الثقافية والفعاليات. يوفر موقع الجامعة في قلب مدينة سانت بطرسبرغ ، إحدى أجمل المدن التاريخية في روسيا ، للطلاب تجربة ثقافية واجتماعية لا مثيل لها.  بشكل عام ، تعد جامعة سانت بطرسبرغ الحكومية اختيارًا ممتازًا للطلاب الذين يسعون للحصول على تعليم من الدرجة الأولى ومجتمع ديناميكي وداعم وتجربة ثقافية لا تُنسى."],
      link: "https://english.spbu.ru/",
      img: imgs.StPetersburg[0],
      
    },
    {
      name: " ITMO جامعة ",
      infos: ["تقع جامعة ITMO في مدينة سانت بطرسبرغ الجميلة ، وهي جامعة رائدة في روسيا والعالم في مجالات تكنولوجيا المعلومات والضوئيات والروبوتات. إن التزام الجامعة بالابتكار والبحوث المتطورة وفرص التعلم العملي يجعلها الخيار الأفضل للطلاب المهتمين بمتابعة المهن في مجال التكنولوجيا والهندسة.  تتمثل إحدى نقاط القوة الرئيسية في ITMO في هيئة التدريس ذات المستوى العالمي ، وكثير منهم خبراء بارزون في مجالات تخصصهم. يكرس أساتذة وباحثو الجامعة جهودهم لتطوير تقنيات وتقنيات جديدة تدفع حدود ما هو ممكن في مجالات مثل الذكاء الاصطناعي والبيانات الضخمة ورؤية الكمبيوتر والروبوتات.  تقدم ITMO مجموعة واسعة من البرامج الأكاديمية ، بما في ذلك شهادات البكالوريوس والدراسات العليا ، بالإضافة إلى البرامج المتخصصة في مجالات مثل هندسة البرمجيات والأمن السيبراني والضوئيات. يعني تركيز الجامعة على التعلم العملي والعملي أنه يتم منح الطلاب العديد من الفرص للعمل في مشاريع واقعية واكتساب خبرة عملية في المجالات التي يختارونها.  بالإضافة إلى برامجها الأكاديمية ، تعد ITMO موطنًا للعديد من مراكز الأبحاث المتطورة ، بما في ذلك مركز الأبحاث الدولي للبوتونات النانوية والمواد الفوقية ومركز تقنيات الكم وعلوم المواد. تجمع مراكز الأبحاث هذه خبراء من جميع أنحاء العالم للتعاون في مشاريع جديدة مبتكرة وتطوير تقنيات جديدة لديها القدرة على تغيير العالم.أخيرًا ، تشتهر جامعة ITMO بمجتمعها النابض بالحياة والشامل ، والذي يضم طلابًا من جميع أنحاء روسيا والعالم. تقدم الجامعة العديد من الفرص للطلاب للمشاركة في الأنشطة اللامنهجية ، بما في ذلك النوادي والفرق الرياضية والفعاليات الثقافية.  باختصار ، تعد جامعة ITMO اختيارًا ممتازًا للطلاب المتحمسين للتكنولوجيا والابتكار ويريدون أن يكونوا في طليعة البحث والتطوير المتطور. مع أعضاء هيئة التدريس على مستوى عالمي ، والبرامج الأكاديمية المبتكرة ، والمجتمع النابض بالحياة ، تعد ITMO الخيار الأفضل للطلاب المهتمين بمتابعة وظائف في التكنولوجيا والهندسة."],
      link: "https://en.itmo.ru/",
      img: imgs.StPetersburg[1],
    },
    {
      name: "جامعة سانت بطرسبرغ الحكوميه للفنون التطبيقيه ",
      infos: ["جامعة بطرسبرغ الحكومية للفنون التطبيقية (SPbPU) هي واحدة من أقدم وأعرق الجامعات التقنية في روسيا ، ولها تاريخ غني من الإنجازات العلمية والتكنولوجية. تقدم الجامعة مجموعة واسعة من برامج البكالوريوس والدراسات العليا في الهندسة والتكنولوجيا والعلوم والاقتصاد والعلوم الإنسانية. لديها أكثر من 30000 طالب ، بما في ذلك الطلاب الدوليين من أكثر من 100 دولة.تشتهر الجامعة بمرافقها البحثية ذات المستوى العالمي والتكنولوجيا المتطورة. يوجد في SPbPU العديد من المعاهد والمراكز البحثية ، بما في ذلك معهد الرياضيات التطبيقية والميكانيكا ، ومعهد الفيزياء النووية ، ومعهد علوم وتكنولوجيا الكمبيوتر. كما أنها موطن للمركز الوطني للحواسيب الفائقة ومركز الابتكار ونقل التكنولوجيا.  تتمتع SPbPU بشراكات قوية مع جامعات ومؤسسات بحثية رائدة في جميع أنحاء العالم ، وتشارك بنشاط في التعاون الأكاديمي والبحثي الدولي. الجامعة عضو في العديد من الجمعيات الدولية ، بما في ذلك رابطة الجامعات الأوروبية والرابطة الدولية للجامعات.يقع حرم SPbPU في قلب مدينة سانت بطرسبرغ ، وهي مدينة تشتهر بتاريخها الغني وثقافتها وهندستها المعمارية. تمتلك الجامعة مرافق حديثة ، بما في ذلك المختبرات والمكتبات والمراكز الرياضية ومهاجع الطلاب المجهزة تجهيزًا جيدًا.بشكل عام ، جامعة بطرسبرغ الحكومية للفنون التطبيقية هي مؤسسة عالمية توفر فرصًا تعليمية وبحثية ممتازة في الهندسة والتكنولوجيا. إنه الخيار الأفضل للطلاب المهتمين بممارسة مهنة في العلوم والتكنولوجيا والابتكار."],
      link: "https://english.spbstu.ru/",
      img: imgs.StPetersburg[3],
    },
    {
      name: "جامعة سانت بطرسبرغ الحكومية الكهروتقنية",
      infos: ["جامعة سانت بطرسبرغ الكهروتقنية ، والمعروفة أيضًا باسم  ، هي جامعة روسية رائدة للتعليم العالي تقع في سانت بطرسبرغ ، روسيا. تأسست الجامعة عام 1886 وهي من أقدم الجامعات التقنية في روسيا. تقدم LETI مجموعة واسعة من برامج البكالوريوس والدراسات العليا في الهندسة الكهربائية وعلوم الكمبيوتر والأتمتة والتحكم والمجالات الأخرى ذات الصلة. تركز الجامعة بشدة على البحث والابتكار ، مع أكثر من 50 معهدًا ومختبرًا للبحوث.تضم الجامعة مجموعة متنوعة من الطلاب تضم أكثر من 10000 طالب من جميع أنحاء العالم. يوفر LETI مرافق ممتازة للطلاب ، بما في ذلك قاعات المحاضرات الحديثة ومختبرات البحوث ومكتبة كبيرة. تلتزم الجامعة بقوة بتعزيز التنوع الثقافي والتعاون الدولي ، مع العديد من برامج التبادل والشراكات مع جامعات أخرى حول العالم.    تتمتع LETI بسمعة طيبة في إنتاج خريجين ذوي مهارات عالية ومستعدين جيدًا لشغل وظائف في صناعة التكنولوجيا. تتمتع الجامعة بعلاقات وثيقة مع كبرى شركات التكنولوجيا الروسية والدولية ، مما يوفر فرصًا ممتازة للطلاب لاكتساب الخبرة العملية وفرص العمل.    في الختام ، تعد جامعة سانت بطرسبرغ الكهروتقنية مؤسسة مرموقة تقدم برامج أكاديمية وفرص بحث ممتازة للطلاب المهتمين في مجالات الهندسة الكهربائية وعلوم الكمبيوتر والأتمتة والتحكم والمجالات ذات الصلة. من خلال التزامها القوي بالبحث والابتكار والتعاون الدولي ، تعد LETI الخيار الأفضل للطلاب الذين يسعون للحصول على تعليم على مستوى عالمي في هذه المجالات."],
      link: "https://etu.ru/",
      img: imgs.StPetersburg[4],
    },
    {
      name: " جامعة سانت بطرسبرغ للتعدين",
      infos: ['تعد جامعة سانت بطرسبرغ للتعدين واحدة من أقدم الجامعات التقنية وأكثرها شهرة في روسيا. تأسست الجامعة عام 1773 ، وهي معروفة ببرامجها ذات المستوى العالمي في مجالات التعدين والجيولوجيا وهندسة البترول. تقدم الجامعة برامج البكالوريوس والدراسات العليا والدكتوراه عبر مجموعة واسعة من المجالات المتعلقة بالموارد الطبيعية وعلوم الأرض. أعضاء هيئة التدريس بالجامعة مؤهلون تأهيلاً عالياً ، ويتألفون من أساتذة وعلماء وباحثين مشهورين هم قادة في مجالات تخصصهم. تم تصميم منهج الجامعة لتزويد الطلاب بأساس نظري قوي مع التأكيد أيضًا على الخبرة العملية وفرص البحث العملي. تمتلك جامعة سانت بطرسبرغ للتعدين العديد من المرافق الحديثة ، بما في ذلك المختبرات المجهزة جيدًا ومراكز البحوث ومتاحف التعدين ، حيث يمكن للطلاب المشاركة في أحدث الأبحاث والابتكارات. تركز الجامعة بشدة على البحوث متعددة التخصصات ، مع العديد من مراكز البحوث والمعاهد المخصصة لمجالات مثل الميكانيكا الجيولوجية والجيوفيزياء ومعالجة المعادن. تمتلك جامعة سانت بطرسبرغ للتعدين أيضًا برنامجًا قويًا لشراكة الصناعة ، مع التعاون مع الشركات العالمية الرائدة مثل Gazprom و Rosneft ، مما يوفر للطلاب فرص تدريب وفرص وظيفية قيّمة. بشكل عام ، تعد جامعة سانت بطرسبرغ للتعدين خيارًا ممتازًا للطلاب المهتمين بمتابعة التعليم العالي في مجالات التعدين أو الجيولوجيا أو هندسة البترول ويرغبون في اكتساب أساس نظري قوي ومهارات عملية للنجاح في حياتهم المهنية في المستقبل.'],
      link: "https://en.spmi.ru/",
      img: imgs.StPetersburg[5],
    },
  ]
  const UfaUniversities = [
    {
      name: "جامعة اوفا  الحكومية  التقنية للطيران",
      img: imgs.Ufa[0],
      infos: ['جامعة اوفا  الحكومية  التقنية للطيران هي جامعة تقنية تحظى باحترام كبير وتقع في أوفا ، روسيا. تأسست الجامعة عام 1932 ، وهي معروفة ببرامجها ذات المستوى العالمي في مجال الطيران والفضاء والهندسة الميكانيكية. تقدم الجامعة برامج البكالوريوس والدراسات العليا والدكتوراه عبر مجموعة واسعة من المجالات المتعلقة بالطيران والفضاء. أعضاء هيئة التدريس بالجامعة مؤهلون تأهيلاً عالياً ، ويتألفون من أساتذة وعلماء وباحثين مشهورين هم قادة في مجالات تخصصهم. تم تصميم منهج الجامعة لتزويد الطلاب بأساس نظري قوي مع التأكيد أيضًا على الخبرة العملية وفرص البحث العملي. تمتلك جامعة Ufa State Aviation University العديد من المرافق الحديثة ، بما في ذلك المختبرات المجهزة جيدًا ومراكز البحث وأجهزة محاكاة الطيران ، حيث يمكن للطلاب المشاركة في أحدث الأبحاث والابتكارات. تركز الجامعة بشدة على الأبحاث متعددة التخصصات ، مع العديد من مراكز البحوث والمعاهد المخصصة لمجالات مثل المواد والهياكل الفضائية وسلامة وأمن الطيران والمركبات الجوية بدون طيار. تمتلك جامعة Ufa State Aviation University أيضًا برنامجًا قويًا لشراكة الصناعة ، مع التعاون مع شركات الطيران والفضاء العالمية الرائدة ، مثل Airbus و Boeing و Sukhoi ، مما يوفر للطلاب فرصًا تدريبية وفرصًا وظيفية قيّمة. بشكل عام ، تعد Ufa State Aviation University اختيارًا ممتازًا للطلاب المهتمين بمتابعة التعليم العالي في مجالات الطيران أو هندسة الطيران ويرغبون في اكتساب أساس نظري قوي ومهارات عملية للنجاح في حياتهم المهنية في المستقبل. تتمتع جامعة Ufa State Aviation University بتاريخ غني من الابتكار والبحث في مجال هندسة الطيران والفضاء. تتمتع الجامعة بتقاليد قوية في التعاون مع صناعة الطيران ، والتي توفر للطلاب تدريبًا عمليًا وفرصًا وظيفية. تم تجهيز الجامعة بمرافق وموارد حديثة ، بما في ذلك مطار يعمل بكامل طاقته مع مدرج وحظائر ، حيث يمكن للطلاب اكتساب الخبرة العملية في تصميم الطائرات وصيانتها وتشغيلها. يوجد بالجامعة هيئة طلابية متنوعة ، مع طلاب من جميع أنحاء روسيا وطلاب دوليين من جميع أنحاء العالم. تقدم الجامعة أيضًا مجموعة من الأنشطة اللامنهجية ، بما في ذلك الرياضة والفعاليات الثقافية والمنظمات الطلابية ، مما يوفر للطلاب فرصًا لتطوير مهارات القيادة والتواصل مع أقرانهم والمشاركة في خدمة المجتمع. تمتلك الجامعة نظامًا شاملاً لدعم الطلاب ، بما في ذلك الإرشاد الأكاديمي والاستشارات والخدمات المهنية ، لضمان حصول الطلاب على الموارد والإرشادات التي يحتاجون إليها للنجاح في مساعيهم الأكاديمية والمهنية. من خلال تركيزها القوي على البحث والابتكار والتدريب العملي ، تعد جامعة Ufa State Aviation University اختيارًا ممتازًا للطلاب المتحمسين للطيران وهندسة الفضاء الجوي ويرغبون في ممارسة مهنة في هذا المجال المثير والديناميكي.'],
      link: "https://ugatu.su/en/",
    },
    {
      name: "جامعة بشكير الطبية الحكومية ",
      img: imgs.Ufa[1],
      infos:['إذا كنت تفكر في دراسة مهنة الطب وتبحث عن مؤسسة ممتازة توفر فرصًا تعليمية وبحثية شاملة ، فلا تبحث عن جامعة بشكير الطبية الحكومية. تقع جامعة Bashkir State Medical University في مدينة أوفا المزدهرة في جمهورية باشكورتوستان بروسيا ، وهي واحدة من الجامعات الطبية الرائدة في البلاد وتجذب الطلاب من جميع أنحاء العالم. تشتهر الجامعة بتعليمها عالي الجودة ، ومرافقها ذات المستوى العالمي ، وأعضاء هيئة التدريس ذوي الخبرة الذين لديهم شغف بعملهم ومكرسين لمساعدة طلابهم على تحقيق أهدافهم. تقدم جامعة بشكير الطبية الحكومية مجموعة واسعة من برامج البكالوريوس والدراسات العليا في مختلف المجالات الطبية ، بما في ذلك الطب العام وطب الأسنان والصيدلة والتمريض والصحة العامة وعلم النفس الطبي. تم تصميم البرامج لتزويد الطلاب بفهم شامل للجوانب النظرية والعملية لمجالهم المختار. يستفيد الطلاب أيضًا من الثقافة البحثية القوية للجامعة ، والتي تتيح لهم فرصة العمل جنبًا إلى جنب مع كبار الباحثين والمشاركة في المشاريع الرائدة التي لديها القدرة على تغيير وجه الطب. كما أن مرافق الجامعة لا يعلى عليها. تفتخر بقاعات محاضرات حديثة ومختبرات مجهزة بالكامل ومرافق سريرية متقدمة توفر للطلاب تدريبًا عمليًا والتعرف على سيناريوهات طبية في العالم الحقيقي. تعد مستشفيات الجامعة واحدة من أفضل المستشفيات في المنطقة وتوفر للطلاب الفرصة لمراقبة الإجراءات الطبية والمشاركة فيها تحت إشراف أطباء ذوي خبرة ، وبصرف النظر عن تميزها الأكاديمي ، تقدم جامعة بشكير الطبية الحكومية أيضًا مجتمعًا طلابيًا نابضًا بالحياة. يجتمع الطلاب من ثقافات وخلفيات مختلفة للتعلم والنمو ، وتشكيل صداقات مدى الحياة وشبكات مهنية قيمة. يكرس موظفو الجامعة أيضًا جهودهم لضمان انتقال الطلاب الدوليين بسلاسة إلى بيئتهم الجديدة وتقديم خدمات دعم متنوعة لمساعدتهم على التكيف مع الثقافة الجديدة.'],
      link: "https://bashgmu.ru/en/",
    },
  ]
  const KazanUniversities = [
    {
      name: "",
      img: "",
      infos: [],
      link: "",
    },
  ]
  const RostovUniversities = [
    {
      name: "",
      img: "",
      infos: [],
      link: "",
    },
  ]
  const YekaterinburgUniversities = [
    {
      name: "",
      img: "",
      infos: [],
      link: "",
    },
  ]

  let Cityimgs: Array<string> = []
  let CityUniversities: Array<any> = []
  switch (Cityname) {
    case "Moscow":
      CityUniversities = MoscowUniversities
      Cityimgs = imgs.Moscow
      break
    case "St Petersburg":
      CityUniversities = StPetersburgUniversities
      Cityimgs = imgs.StPetersburg
      break
    case "Ufa":
      CityUniversities = UfaUniversities
      Cityimgs = imgs.Ufa
      break
    case "Kazan":
      CityUniversities = KazanUniversities
      Cityimgs = imgs.Kazan
      break
    case "Rostov":
      CityUniversities = RostovUniversities
      Cityimgs = imgs.Rostov
      break
    case "Yekaterinburg":
      CityUniversities = YekaterinburgUniversities
      Cityimgs = imgs.Yekaterinburg
      break
  }
  const CityUniversitiesHtml: Array<JSX.Element> = CityUniversities.map(({ name, infos, link }, i) => {
    return (
      <div key={i} className={'w-full max-w-6xl  rounded-br-3xl shadow-lg py-8 text-right flex-col-reverse justify-end flex mt-10 md:mt-28  ' + state.bgApp + state.shadowColor + (i === 0 || i % 2 === 0 ? "md:flex-row-reverse" : "md:flex-row")}>
        <div className='md:w-2/3 text-right ltr bidi-override'>
          {infos.map((info: string, i: number) => {
            return <p key={i} className={'font-Cairo text-xs md:text-base text-right mx-8 my-2 ' + state.fontColor}>{readMore? info: `${info.substring(0,1000)}...`}
            <button className="text-sky-400 hover:text-sky-800 font-bold py-2 px-4 rounded:" onClick={()=> setReadMore(!readMore)}>{readMore? "عرض أقل" : "اقرأ أكثر"}</button></p>
          })}
          <a className='font-Cairo text-sm md:text-base text-center mx-8 text-[#48cae4] font-bold underline ' target="_blank" href={link}>موقح الجامعة</a>
        </div>
        <div >
          <div className='select-none'><img src={Cityimgs[i]} className={"hidden md:block -mt-24 h-96 w-96 rounded-lg shadow-lg  " + state.shadowColor}></img></div>
          <h1 className={'font-Cairo text-sm md:text-xl font-extrabold text-center mt-1 ' + state.fontColor} >{name}</h1>
        </div>
      </div>
    )
  })

  return (
    <div>
      <div className={'w-full mt-8 flex justify-center '}>
        <div className={"w-full max-w-6xl p-8 rounded-2xl shadow-lg flex flex-col justify-center items-center mx-2  " + state.bgColor + state.shadowColor}>

          <div className='flex justify-center mb-2'>
            <div className={'h-px w-6 mt-3 md:mt-4 mr-1 ' + (state.dark ? "bg-[#FFFFFF] " : "bg-[#214966] ")} ></div>
            <h1 className={'font-Cairo md:text-xl text-sm font-extrabold text-center ' + state.fontColor}>اشهر الجامعات في المدينة</h1>
            <div className={'h-px w-6 mt-3 md:mt-4 mr-1 ' + (state.dark ? "bg-[#FFFFFF] " : "bg-[#214966] ")} ></div>
          </div>

          {CityUniversitiesHtml}

        </div>
      </div>
    </div>
  )
}

export default TopUnivers